TDPortal/Utilities/EnhancedExposedServicesTestTool/ExposedServicesTestToolClient/Requests/CarJourneyPlannerSynchronous/V1/PlanCarJourney - Toll - Road.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <PlanCarJourney xmlns="http://www.transportdirect.info/TransportDirect.EnhancedExposedServices.CarJourneyPlannerSynchronous.V1">
      <transactionId>testCarJourneyPlanner</transactionId>
	  <request>
		<JourneyRequests>
			<JourneyRequest>
			  <JourneyRequestId>01</JourneyRequestId>
			  <OriginLocation>
				<Description>Coventry, West Midlands</Description>
				<Type>Coordinate</Type>
				<GridReference>
					<Easting>433345</Easting>
					<Northing>278752</Northing>
				</GridReference>
			  </OriginLocation>
			  <DestinationLocation>
				<Description>Manchester (City Centre), Manchester, Greater Manchester</Description>
				<Type>Coordinate</Type>
				<GridReference>
					<Easting>384244</Easting>
					<Northing>398379</Northing>
				</GridReference>
			  </DestinationLocation>
			  <OutwardDateTime>2014-04-18T13:00:00</OutwardDateTime>
			  <ReturnDateTime>2014-04-19T16:00:00</ReturnDateTime>
			  <OutwardArriveBefore>false</OutwardArriveBefore>
			  <ReturnArriveBefore>false</ReturnArriveBefore>
			  <IsReturnRequired>false</IsReturnRequired>
			</JourneyRequest>
		</JourneyRequests>
		<CarParameters>
			<UseRoads>
				<string>M6 TOLL</string>
			</UseRoads>
		</CarParameters>
		<ResultSettings>
			<DistanceUnit>Miles</DistanceUnit>
		</ResultSettings>
      </request>
    </PlanCarJourney>
  </soap:Body>
</soap:Envelope>
